//
//  ViewController.h
//  Component
//
//  Created by DaFenQi on 16/9/20.
//  Copyright © 2016年 DaFenQi. All rights reserved.
//

#import <UIKit/UIKit.h>

/**
 *  组合模式
 * 将对象组合成树形结构以表示"整体部分"的层次结构,组合使得用户对于单个对象和组合对象的使用具有一致性
 */

/**
 *  组合模式
 * 将对象组合成树形结构以表示"部分整体"关系层次结构,组合使得用户对于单个对象和组合对象的使用具有一致性
 */

/**
 *  组合模式
 * 将对象组合成树形结构以表示部分整体关系层次结构,组合使得用户对于单个对象和组合对象的使用具有一致性
 */

/**
 *  何种情况使用组合模式
 * 想要获得对象的树形表示
 * 想让客户端统一处理组合对象中的所有对象
 */
 
/**
 *  组合模式的主要意图是让树形结构中的每一个节点都有相同的接口.
 * 这样整个结构可作为一个统一的抽象结构使用,而不暴露内部标识
 * 对每个节点的任何操作可以通过协议或者抽象基类中定义的相同接口来执行
 */

/**
 *  组合模式的主要意图是让树形结构的每一个节点都有相同的接口
 * 这样整个结构可作为一个统一的抽象结构使用,而不暴露内部表示
 * 对于每个借点的任何操作可以通过协议或者抽象基类中定义的相同接口来执行
 */

@interface ViewController : UIViewController


@end

